# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\work\PSoC4\VertushkaAnalog\VertushkaAnalog.cydsn\VertushkaAnalog.cyprj
# Date: Tue, 24 Nov 2020 20:17:26 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 9 17} [list]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 43 87} -nominal_period 1791.6666666666665 [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {CLK_20Hz} -source [get_pins {ClockBlock/hfclk}] -edges {1 1200001 2400001} [list [get_pins {ClockBlock/udb_div_3}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\work\PSoC4\VertushkaAnalog\VertushkaAnalog.cydsn\TopDesign\TopDesign.cysch
# Project: C:\work\PSoC4\VertushkaAnalog\VertushkaAnalog.cydsn\VertushkaAnalog.cyprj
# Date: Tue, 24 Nov 2020 20:17:21 GMT
